run/tutorials/JetFlameH2/steady/01-ED-1step/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    inletfuel
    {
        type            patch;
        nFaces          3;
        startFace       3166;
    }
    inletair
    {
        type            patch;
        nFaces          20;
        startFace       3169;
    }
    outlet
    {
        type            patch;
        nFaces          26;
        startFace       3189;
    }
    axis
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          0;
        startFace       3215;
    }
    leftside
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          65;
        startFace       3215;
    }
    burnerwall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          7;
        startFace       3280;
    }
    front
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          1629;
        startFace       3287;
    }
    back
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          1629;
        startFace       4916;
    }
)

// ************************************************************************* //
